tap "bufbuild/buf"
tap "go-task/tap"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "opencode-ai/tap"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Library and utilities for processing GIFs
brew "giflib"
# Spell checker with better logic than ispell
brew "aspell"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Console Matrix
brew "cmatrix"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Render markdown on the CLI
brew "glow"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# Gnumeric spreadsheet program
brew "goffice"
# GNOME Spreadsheet Application
brew "gnumeric"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Make XML documents translatable through PO files
brew "itstool"
# Image manipulation library
brew "jpeg"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Powerful, lightweight programming language
brew "lua@5.3"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Tool Command Language
brew "tcl-tk"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
brew "opencode-ai/tap/opencode"
# Tool for creating locally-trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Open-source keystroke visualiser
cask "keycastr"
# A custom version of Firefox, focused on privacy, security and freedom
cask "librewolf"
mas "Harvest", id: 506189836
mas "Numbers", id: 409203825
mas "Quiver", id: 866773894
mas "SimpleMind", id: 439654198
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
cargo "cross"
